In [1]:
# Combining DataFrames :

In [2]:
import numpy as np 
import pandas as pd

In [15]:
# .concat

In [3]:
data_one = {'A' : ['A0', 'A1', 'A2', 'A3'], 'B' : ['B0', 'B1', 'B2', 'B3']}
data_two = {'C' : ['C0', 'C1', 'C2', 'C3'], 'D' : ['D0', 'D1', 'D2', 'D3']}

In [4]:
one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)

In [5]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [6]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [10]:
pd.concat([one, two], axis = 1) # one ve two satirlarda yan yana birlestir.

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [13]:
pd.concat([one, two], axis = 0) # one ve two sütunlarda alt alta birlesitir.(a, b icin indexler ve c, d icin indexler farkli gösterilir.)
                                # domain olarak iki farkli DataFrame icin farkli indexler arka planda kaydedilir ( ayni gözükse bile).

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [9]:
pd.concat([two, one], axis = 1)

    C   D   A   B
0  C0  D0  A0  B0
1  C1  D1  A1  B1
2  C2  D2  A2  B2
3  C3  D3  A3  B3

In [14]:
# merge

In [69]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [70]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [71]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [72]:
pd.merge(registrations, logins, how = 'inner', on = 'name')
# solda registrations table sagda ise logins table olcak sekilde birlesim yapar. 
# inner ile her iki DataFramede de ortak olan verilerin birlestirilmesi saglanir.
# on ile de birlestirmenin hangi sütuna göre yapilacagi belirtilir.

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [73]:
pd.merge(logins, registrations, how = 'inner', on = 'name') # inner gibi baska birlestirme türleri vardir. inner ciktisi bu sekildedir.

   log_id    name  reg_id
0       2  Andrew       1
1       4    Bobo       2

In [74]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [75]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [76]:
pd.merge(left = registrations, right = logins, how = 'left', on = 'name')  # normalde önce sol sonra sag DataFrame otomatik algilanir.

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [77]:
# how = 'inner': Her iki DataFrame'de de ortak olan verileri birleştirir; yalnızca kesişen kayıtlar kalır.
# how = 'left': Sol taraftaki (birinci) DataFrame'deki tüm kayıtları korur ve sağ taraftaki (ikinci) DataFrame'den eşleşenleri ekler; 
    # eşleşmeyen kayıtlar için NaN değerleri eklenir.
# how = 'right': Sağ taraftaki (ikinci) DataFrame'deki tüm kayıtları korur ve sol taraftaki (birinci) DataFrame'den eşleşenleri ekler; 
    # eşleşmeyen kayıtlar için NaN değerleri eklenir.
# how = 'outer': Her iki DataFrame'deki tüm kayıtları birleştirir; eşleşmeyen kayıtlar için NaN değerleri eklenir. 
    # Bu, tüm kayıtları koruyan bir birleşim türüdür.

In [78]:
pd.merge(left = registrations, right = logins, how = 'right', on = 'name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [79]:
# eger bir tane sütun secenegi varsa on kisminda ekstra bir sey yazilmasina gerek yoktur, pandas otomatik olarak algilar. 
# ama okuma kolayligi icin her zaman belirtilmesi tercih edilir.

In [80]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [81]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [82]:
pd.merge(registrations, logins, how = 'outer', on = 'name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [83]:
registrations = registrations.set_index('name')

In [84]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [85]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [86]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [87]:
pd.merge(registrations, logins, left_index = True, right_on = 'name', how = 'inner')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [88]:
registrations = registrations.reset_index()     # index degisiklikleirni sifirlar.

In [89]:
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

In [90]:
registrations.columns = ['reg_name', 'reg_id']

In [91]:
results = pd.merge(registrations, logins, how = 'inner', left_on = 'reg_name', right_on = 'name')

In [92]:
results

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [93]:
results.drop('reg_name', axis = 1)

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo

In [94]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [95]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [97]:
registrations.columns = ['name', 'id']

In [98]:
logins.columns = ['id', 'name']

In [103]:
pd.merge(registrations, logins, how = 'inner', on = 'name', suffixes = ('_reg', '_log'))  
# pandas otomatik olarak id leri ayirir ayni isim iki DF de de oldugu icin.

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4

In [104]:
# Text Method :

In [105]:
email = 'jose@email.com'
email.split('@')

['jose', 'email.com']

In [106]:
names = pd.Series(['andrew', 'bobo', 'claire', 'david', '5'])

In [107]:
names

0    andrew
1      bobo
2    claire
3     david
4         5
dtype: object

In [108]:
names.str.upper()

0    ANDREW
1      BOBO
2    CLAIRE
3     DAVID
4         5
dtype: object

In [109]:
names

0    andrew
1      bobo
2    claire
3     david
4         5
dtype: object

In [110]:
email.isdigit()

False

In [111]:
'5'.isdigit()

True

In [112]:
# names.str.---      kisminda tab a basaarak bir sürü farkli fonksiyon alternatiflerini görebilirsin.

In [114]:
names.str.isdigit() # string türleri icin isdigit()  fonksiyonu True ifadesi döndürür.

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [115]:
tech_finance = ['GOOG,APPL,AMZN', 'JPM,BAC,GS']

In [116]:
len(tech_finance)

2

In [118]:
tickers = pd.Series(tech_finance)

In [119]:
tickers

0    GOOG,APPL,AMZN
1        JPM,BAC,GS
dtype: object

In [120]:
tickers.str.split(',')

0    [GOOG, APPL, AMZN]
1        [JPM, BAC, GS]
dtype: object

In [121]:
tech = 'GOOG,APPL,AMZN'

In [122]:
tech.split(',')[0]

'GOOG'

In [124]:
tickers.str.split(',').str[0]  # 0. indexteki verileri yazdiririz.

0    GOOG
1     JPM
dtype: object

In [126]:
tickers.str.split(',', expand = True)   # expand default olarak False dur. expand ile yeni sütunlara split yerlerinden ayriririz.

      0     1     2
0  GOOG  APPL  AMZN
1   JPM   BAC    GS

In [139]:
messy_names = pd.Series(['andrew', "bo;bo", 'claire'])

In [140]:
messy_names

0    andrew
1     bo;bo
2    claire
dtype: object

In [144]:
messy_names.str.replace(';',' ')       # ikinci parantez ; yeirne ne gelmesi gerektigini belirleyen parametredir. Bosluk yaptik!

0    andrew
1     bo bo
2    claire
dtype: object

In [150]:
messy_names.str.replace(';',' ').str.strip()
# str.strip() metodu, bir stringin başında ve sonunda bulunan boşlukları (veya belirtilen karakterleri) kaldırır.

0    andrew
1     bo bo
2    claire
dtype: object

In [148]:
messy_names.str.replace(';',' ').str.strip()[0]

'andrew'

In [147]:
messy_names.str.replace(';',' ').str.strip().str.capitalize()  # ilk harfler büyüdü

0    Andrew
1     Bo bo
2    Claire
dtype: object

In [149]:
messy_names

0    andrew
1     bo;bo
2    claire
dtype: object

In [151]:
### Time Methods

In [152]:
from datetime import datetime

In [153]:
myyear = 2015
mymonth = 1
myday = 1
myhour = 2
mymin = 30 
mysec = 15

In [155]:
mydate = datetime(myyear, mymonth, myday)

In [161]:
mydate # saat dakika gibi deglerleri otomatik oalrak sifir gösterir, belirtilmedigi icin.

datetime.datetime(2015, 1, 1, 0, 0)

In [157]:
mydatetime = datetime(myyear, mymonth, myday, myhour, mymin, mysec)

In [158]:
mydatetime

datetime.datetime(2015, 1, 1, 2, 30, 15)

In [160]:
mydatetime.year  # future engineering icin kullanisli yöntemler.

2015

In [190]:
myser = pd.Series(['November 3 1990', '01-01-2000', None])

In [191]:
myser

0    November 3 1990
1         01-01-2000
2               None
dtype: object

In [192]:
myser[0] # bu bir object verisidir, yani string.

'November 3 1990'

In [193]:
myser[0].year # bu bir string object oldugu icin .year islemi hata verir.

AttributeError: 'str' object has no attribute 'year'

In [194]:
pd.to_datetime(myser, errors = 'coerce')  # format='%m-%d-%Y' --> parantez icerisine format parametresi ile verilerin istendigi hal yazilir

0   1990-11-03
1          NaT
2          NaT
dtype: datetime64[ns]

In [195]:
timeser = pd.to_datetime(myser, errors = 'coerce')

In [197]:
timeser[0].year

1990

In [198]:
obvi_euro_date = '31-12-2000'

In [199]:
pd.to_datetime(obvi_euro_date)

/var/folders/j4/nj07815j3q9_wz_8g3ghf5r40000gn/T/ipykernel_52204/163700324.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

In [200]:
euro_date = '10-12-2000'

In [203]:
pd.to_datetime(euro_date) # amerikalilara göre 10 ay avrupalilara göre 12 ay olarak okunur. Bu farki dikkat etmek gerekir.

Timestamp('2000-10-12 00:00:00')

In [205]:
pd.to_datetime(euro_date, dayfirst = True) # day böylece birinci öncelikte oldugu belirtilip algilanmasi saglandi.

Timestamp('2000-12-10 00:00:00')

In [206]:
style_date = '12--Dec--2000'

In [210]:
pd.to_datetime(style_date, format = '%d--%b--%Y')# burda tekrar format metodu ile gün ay yil siralmasinin nasil gösterilecegine deginiliyor

Timestamp('2000-12-12 00:00:00')

In [211]:
custom_date = "12th of Dec 2000"

In [212]:
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

In [224]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')

In [225]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [234]:
sales['DATE'] = pd.to_datetime(sales['DATE'])   # Date sütununu datetime modülünde kullanmak icin dönüstürme ilemi yapariz.

In [235]:
sales['DATE'][0].year

1992

In [252]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv', parse_dates=[0])
# parse_dates=[0] parametresi, CSV dosyasındaki birinci sütundaki verilerin otomatik olarak tarih formatına dönüştürülmesini sağlar.

In [253]:
sales.head()

        DATE  MRTSSM4453USN
0 1992-01-01           1509
1 1992-02-01           1541
2 1992-03-01           1597
3 1992-04-01           1675
4 1992-05-01           1822

In [254]:
sales = sales.set_index("DATE")

In [255]:
sales

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [256]:
sales.resample(rule = 'A').mean()   # her yil icin ortalama degerin alinmasi saglanir. 

# rule parametresi, zaman serisi verilerini belirli bir zaman dilimine (örneğin, günlük, aylık, yıllık) göre gruplandırarak 
# yeniden örneklemeyi sağlar. 'A' kullanıldığında, veri yıllık olarak gruplandırılır ve her yılın ortalama değeri hesaplanır.

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [261]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv')
sales['DATE'] = pd.to_datetime(sales['DATE'])
sales['DATE'].dt.year 
# .dt.year gibi month day gibi ögeler DATE sütunundan otomatik olarak datetime a önceki satirda ayarlandigi icin yazdirilabilir.

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int32

In [262]:
print(sales.columns)

Index(['DATE', 'MRTSSM4453USN'], dtype='object')